{"basics":{"name":"Kumar Selvakumaran","image":"assets/img/prof_pic.png","email":"kumar.selvak.27@gmail.com","phone":"(857) 396-6078","url":"https://alshedivat.github.io/al-folio/","location":{"address":"71 Forest Hills st.","postalCode":"MA 02130","city":"Boston","countryCode":"US","region":"massachusetts"},"profiles":[{"network":"Linkedin","username":"kumar-selva","url":"https://www.linkedin.com/in/kumar-selva/"}]},"education":[{"institution":"Northeastern University","location":"Boston, massachusetts","url":"https://www.northeastern.edu/","area":"Artificial Intelligence","studyType":"Master of Science","startDate":"2023-09-02","endDate":"2025-12-20","score":"3.76","courses":["Algorithms, Foundations of AI, Unsupervised ML, Pattern Recognition and Computer Vision, Machine Learning, Mobile Robotics, Verifiable ML, AI for HCI"]}],"work_short":[{"name":"Norfolk Southern","position":"Generative AI Intern","startDate":"2025-01-13","endDate":"2025-04-04","summary":"Developed an agentic RAG solution and engineered GPU-accelerated, high-throughput computer vision and Big Data pipelines."},{"name":"Inflohealth","position":"Artificial Intelligence Intern","startDate":"2024-05-20","endDate":"2024-08-20","summary":"Built a language model pipeline that processes millions of radiology reports to curate datasets for downstream healthcare analytics."},{"name":"Sentient.io","position":"Artificial Intelligence Intern","startDate":"2023-05-15","endDate":"2023-08-15","summary":"Customized open-source computer vision models with application-specific optimizations for AI microservices."},{"name":"Juhomi","position":"Artificial Intelligence Engineer Intern","startDate":"2021-04-05","endDate":"2022-09-05","summary":"Co-developed an AI-powered, microservice-based retail analytics platform from the ground up; it was contracted by four MNCs."}],"work":[{"name":"Norfolk Southern","position":"Generative AI Intern","startDate":"2025-01-13","endDate":"2025-04-04","summary":"Developed an agentic RAG solution and engineered GPU-accelerated, high-throughput computer vision and Big Data pipelines.","highlights":["Implemented a multimodal RAG workflow on the Qdrant vector database for large-scale PDF-based question answering","Developed a large-scale PDF retrieval pipeline using the ColPali model, improving top-5 recall by 8% over OCR solutions.","Built a multi-agent system that divides the task into sub-tasks, leverages a document retriever, a metadata crawler, and feedback loops to maximize cited content and diagram inclusions in the generated answer","Implemented a system prompt refinement module using Mutual Information Maximization on LLM-generated candidates which demonstrated an average reduction of 6.2 steps for task completion, and a 14% increase in task completion rate.","Accelerated data manipulation with NVIDIA RAPIDS and Spark, saving 23% in cost and reducing total job time by 30%."," Migrated the data loader pipeline to NVIDIA DALI and Ray, boosting throughput of large-scale model evaluation by 2.1 times."]},{"name":"Inflohealth","position":"Artificial Intelligence Intern","startDate":"2024-05-20","endDate":"2024-08-20","summary":"Built a language model pipeline that processes millions of radiology reports to curate datasets for downstream healthcare analytics.","highlights":["Fine-tuned the CXR-BERT biomedical transformer language model on 830,000 radiology reports across four T4 GPUs using Distributed Data Parallel and adapted it for knowledge-graph creation using the RadGraph-XL dataset.","Built an explainability module that highlights text spans relevant to specific nodes by visualizing BERT’s attention maps.","Achieved a retrieval F1 score of 0.81, on par with LLaMA 3 8B, while additionally supporting evidence selection","Containerized the retrieval system as a serverless FastAPI application and deployed it on AWS App Runner","Developed an XGBoost classification pipeline on radiology claims (such as encounter, diagnosis, and procedure codes) to predict follow-up likelihood, achieving 0.72 AUC and improving recall of missed visits by 18%."]},{"name":"Sentient.io","position":"Artificial Intelligence Intern","startDate":"2023-05-15","endDate":"2023-08-15","summary":"Customized open-source computer vision models with application-specific optimizations for AI microservices.","highlights":["Implemented a video action-recognition pipeline, quantizing the model with TensorRT to reduce latency by 12%.","Reduced video object detection misclassification rate by 7% using a Kalman filter motion model.","Built a general-purpose auto-labeler using SAM and GroundingDINO, which was applied to three datasets (15,000+ images)."]},{"name":"Juhomi","position":"Artificial Intelligence Engineer Intern","startDate":"2021-04-05","endDate":"2022-09-05","summary":"Co-developed an AI-powered, microservice-based retail analytics platform from the ground up; it was contracted by four MNCs.","highlights":["Managed a crowdsourced data annotation job for object detection of 252 product classes across 4750 images in Amazon Mechanical Turk, and developed a YOLOv5-based auto-labeller in Amazon SageMaker to extend the dataset to 21,000 images.","Integrated image super-resolution and optical character recognition (OCR) improving mAP by 0.2 over naive object detection.","Demonstrated the combined detection pipeline’s ability to perform zero-shot object detection of previously unseen classes.","Upgraded the API architecture to support asynchronous communication using FastAPI with Uvicorn, enabling an API throughput increase of 341% (i.e., from 12 requests per second to 53 requests per second).","Developed continuous training and monitoring workflows using Apache Airflow, Data Version Control, and MLflow, enabling class-specific model updates through model-guided data selection (active learning)."]}],"projects":[{"name":"HuskyGuide: Database Interface Agent (sponsored)","releaseDate":"2025-07-02","highlights":["Spearheaded the development of a multi-agent system leveraging Northeastern University’s knowledge base for policy navigation.","Developed a SQL agent that generates complex queries through multi-hop reasoning using execution plans and database contents.","Illustrated the algorithm’s behavior and efficacy through comprehensive visualizations"],"url":"https://huggingface.co/spaces/KumarSel/database_agent"},{"name":"RobAnn: Exploring Neural Network Robustness","releaseDate":"2024-10-02","highlights":["Developed an algorithm to quantify deep neural networks’ resistance to adversarial attacks and noisy perturbations.","Performed feature-wise robustness analysis to expose adversarially susceptible neurons by targeted weight perturbation.","Implemented it with LangChain and packaged it as a FastAPI app that supports integration into concurrent multi-agent systems."],"url":"https://www.datascienceportfol.io/kumarselvakumaran/projects/5"},{"name":"ProdSeek: Semantic Product Catalog Search","releaseDate":"2024-10-02","highlights":["Developed a recommender that takes product selections from images and suggests similar products from a product image corpus","Built an adaptive vector search using YOLOv3; embeds live product selections and performs real-time semantic retrieval.","Conducted ablation studies demonstrating higher product specificity and qualitative semantic capacity than ResNet embeddings."],"url":"https://www.datascienceportfol.io/kumarselvakumaran/projects/0"}],"publications":[{"name":"Transformers for Browse Node Classification with Class Imbalance","publisher":"IEEE","releaseDate":"2023-07-21","url":"https://ieeexplore.ieee.org/document/10183484","highlights":["Published in the 2023 International Conference on Computational Intelligence and Sustainable Engineering Solutions (CISES)","Fine-tuned the DeBERTa transformer model for e-commerce classification on 10M+ records across 250 browse node categories","Applied Focal Loss to mitigate severe class imbalance by down-weighting the gradient updates of dominant classes over time.","Achieved an increase of 2% in validation accuracy with faster convergence compared to vanilla DeBERTa and other BERT variants."]},{"name":"Safety surveillance using Explainable Object Detection","publisher":"Springer","releaseDate":"2023-06-15","url":"https://link.springer.com/chapter/10.1007/978-981-99-0838-7_21","highlights":["Published in Smart Trends in Computing and Communications (SmartCom 2023) as a part of the book series: Lecture Notes in Networks and Systems ((LNNS,volume 650))","Built an automatic object detection explainer that visualizes the top three salient activation regions influencing predictions.","Implemented a novel model-agnostic pipeline that automatically finds salient layers to bypass manual exploration.","Demonstrated the pipeline on an artificially biased dataset simulating effects of irresponsible data collection practices.","Augmented the object detection pipeline with Sobel features to improve generalizability and reduce bias."]},{"name":"AR-enabled textbooks","publisher":"IEEE","releaseDate":"2023-08-01","url":"https://ieeexplore.ieee.org/abstract/document/10193488","highlights":["Published in 2023 4th International Conference on Electronics and Sustainable Communication Systems (ICESC)","Built an Augmented Reality mobile application that scans QR codes embedded in textbooks to render animated 3D models.","Secured TNSCST funding to deploy the AR pipeline in 9th-grade textbooks for the Tamil Nadu state curriculum."]}],"skills":[{"name":"Programming Languages","keywords":["Python","C++","C","SQL"]},{"name":"Frameworks & Libraries","keywords":["PyTorch","TensorFlow","HuggingFace","LangChain","Ray","NVIDIA Rapids","NVIDIA DALI","FastAPI"]},{"name":"Tools & Platforms","keywords":["Git","Apache Spark","Airflow","MLflow","Docker","Uvicorn","Databricks","DataRobot"]},{"name":"Databases & Vector Stores","keywords":["PostgreSQL","Qdrant"]},{"name":"Cloud Providers & Services","keywords":["GCP: Cloud Run","GCP: Kubernetes Engine","AWS: SageMaker","AWS: Lambda","AWS: EC2","AWS: App Runner"]}]}